Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །འདུག་དང་འགྲེང་དང་འཆག་པ་ལ། །འཕགས་པ་དག་ནི་མ་གཡོགས་མཛེས། །ནོར་བུ་རིན་ཆེན་འོད་གསལ་བ། །རྒྱལ་མཚན་རྩེ་མོར་གསལ་ན་མཛེས།
en: “A noble being shines when uncovered, Whether sitting, standing, or walking, Like a precious gem beaming, Radiant on the pinnacle of a standard.

source: །འཕགས་པ་འགྲོ་ནའང་མཛེས་པ་སྟེ།
en: “While going, a noble being shines,

source: །འོང་ནའང་དེ་བཞིན་མཛེས་པ་ཡིན།
en: And likewise while coming, a noble being shines.

source: །འགྲེང་བ་འམ་དེ་བཞིན་འདུག་པ་དང་། །ཐམས་ཅད་དུ་ཡང་འཕགས་པ་མཛེས།
en: While rising or sitting, A noble being always shines.

source: །འཕགས་པ་སྨྲ་ནའང་མཛེས་པ་སྟེ།
en: “A noble being shines when speaking,

source: །མི་སྨྲར་འདུག་ཀྱང་དེ་བཞིན་མཛེས།
en: And even when silent, a noble being shines,

source: །དཔེར་ན་ཀ་ལ་པིང་ཀ་ནི།
en: Just like a nightingale does

source: །མཐོང་དང་སྒྲ་ཐོས་དེ་བཞིན་ནོ།
en: Whenever seen or heard.

source: །ཀུ་ཤའི་གོས་ནི་གྱོན་པ་དང་། །གོས་ངན་གྱོན་དང་ལུས་རིད་པ།
en: “Whether he wears clothes made of kuśa grass, Poor quality clothes, or his body is emaciated,

source: །དེ་ནི་རང་གི་གཟི་ཡིས་མཛེས། །ཡོན་ཏན་ལྡན་པ་ཡོན་ཏན་བརྒྱན།
en: One who is replete with good qualities and is adorned by those qualities Shines with his own radiance.

source: །གང་ལ་སྡིག་པ་མེད་གྱུར་པ། །འཕགས་པ་ཀུན་ཏུ་དགེ་བ་ཡིན། །བྱིས་པ་སྡིག་པ་བྱེད་པ་ནི། །ཇི་སྙེད་བརྒྱན་ཀྱང་མཛེས་མ་ཡིན།
en: “A noble one without evil Shines perpetually, Whereas an immature being who commits evil Never shines no matter what he wears.

source: །གང་དག་སྙིང་ལ་སྡིག་པ་ཡོད་ཅིང་ཚིག་འཇམ་པ། །དེ་དག་དུག་གི་བུམ་པར་བདུད་རྩི་བླུགས་པ་བཞིན།
en: “Those who have evil in their hearts but whose speech is sweet Are like a jar of poison topped off with nectar.

source: །བྲག་གི་སེར་ག་རྩུབ་པ་ལྟ་བུར་ནང་ཡང་རྩུབ། །དེ་འདྲ་དེ་དག་སྦྲུལ་གྱི་ཁ་ལ་ཉུག་པ་བཞིན།
en: Like a rocky stone rough to the touch, they are hard inside; Being with them is like caressing a viper’s head.

source: །དེས་པ་དེ་དག་གན་དུ་ཀུན་འོང་ཀུན་ཕྱག་འཚལ།
en: “The truly gentle are approached and honored by all,

source: །འབབ་སྟེགས་ཐམས་ཅད་ལྟ་བུར་འགྲོ་བ་ཀུན་གྱི་གསོས།
en: Just like a sacred bathing bank, which sustains everyone.

source: །འཕགས་པ་དག་ནི་རྟག་ཏུ་འོ་ཞོས་བཀང་བུམ་འདྲ།
en: Noble beings are like a jar filled with milk and curd;

source: །བདག་ཉིད་དག་པ་དེ་འདྲ་མཐོང་ན་བཀྲ་ཤིས་དགེ།
en: It is extremely auspicious to behold such a pure nature.

source: །གང་དག་སྡིག་པའི་གྲོགས་པོ་ཡུན་རིང་ཡོངས་སྤོང་ཞིང་།
en: “Those who have long shunned evil companions,

source: །དགེ་བའི་བཤེས་གཉེན་རིན་པོ་ཆེས་ནི་ཡོངས་བཟུང་ལ།
en: Who are now surrounded by precious spiritual friends,

source: །སྡིག་པ་རྣམ་སྤོང་སངས་རྒྱས་ཆོས་ལ་མངོན་ཆགས་པ།
en: Who relinquish evil deeds and adhere to the teaching of the buddhas

source: །དེ་ལྟ་བུ་དག་མཐོང་བ་བཀྲ་ཤིས་འབྲས་བུ་ཡོད།
en: Are fruitfully auspicious to behold.

source: །གང་དག་ལུས་བསྡམས་ལུས་ཀྱི་སྐྱོན་རྣམས་རབ་བསྡམས་དང་། །གང་དག་ཚིག་བསྡམས་རྟག་ཏུ་ཚིག་འཆལ་མེད་གྱུར་ལ།
en: “Those who control their bodies thus control all physical faults; Those who control their speech never confuse their words;

source: །དབང་པོ་སྦས་ཤིང་ཤིན་ཏུ་བསྡམས་ལ་ཡིད་དང་བ།
en: Those with guarded senses are mentally composed and serene.

source: །དེ་ལྟ་བུ་དག་གདོང་གཡོགས་ཏེ་ནི་ཅི་ཞིག་བྱ།
en: What good is it to cover the face of such beings?

source: །གལ་ཏེ་ལུས་ལ་གོས་ནི་སྟོང་གིས་གཡོགས་གྱུར་ཀྱང་།
en: “Others may be covered in a thousand garments,

source: །གང་དག་སེམས་བཤུས་ངོ་ཚ་མེད་ཅིང་ཁྲེལ་མེད་དང་། །གང་དག་འདི་འདྲའི་ཡོན་ཏན་མེད་ཅིང་བདེན་ཚིག་མེད།
en: But if their minds are revealed to lack shame and modesty And if they have no good qualities and lack truthful speech,

source: །དེ་དག་སྒྲེན་མོ་བས་ཀྱང་སྒྲེན་མོར་འཇིག་རྟེན་རྒྱུ།
en: Then they move through the world more naked than naked.

source: །གང་ཞིག་སེམས་སྦས་རྟག་ཏུ་དབང་པོ་བསྡམས་གྱུར་ཅིང་།
en: “There are those who conceal their mind and restrain their senses,

source: །བདག་གི་ཁྱོས་ཆོག་སེམས་ཅན་གཞན་ལ་མི་སེམས་པ།
en: Who are satisfied with their husbands and do not pine after others.

source: །དེ་འདྲ་བ་དག་ཉི་ཟླ་བཞིན་དུ་མ་གཡོགས་ས་སྣང་།
en: When they shine unconcealed, like the sun and moon,

source: །དེ་འདྲ་བ་དག་གདོང་གཡོགས་ཏེ་ནི་ཅི་ཞིག་བྱ།
en: What good is it to cover their faces?

source: །གཞན་ཡང་དྲང་སྲོང་བདག་ཉིད་ཆེ་དང་གཞན་སེམས་བློ་མཁས་དང་། །དེ་བཞིན་ལྷ་ཚོགས་དག་གིས་ཁོ་མོའི་བསམ་པ་དང་། །ཁོ་མོའི་ཚུལ་ཁྲིམས་ཡོན་ཏན་སྡོམ་དང་བག་ཡོད་མཁྱེན།
en: “Furthermore the great sages, those who know the thoughts of others, And the assemblies of gods all know my thoughts. They know my discipline, qualities, restraint, and carefulness;

source: །དེ་ལྟ་བས་ན་ཁོ་མོས་གདོང་བཀབ་ཅི་ཞིག་དགོས།
en: So why should I veil my face?”

source: །དགེ་སློང་དག་རྒྱལ་པོ་ཟས་གཙང་མས་ཤཱཀྱའི་བུ་མོ་ས་འཚོ་མའི་སྤོབས་པ་དང་བསྟན་པའི་ཚིགས་སུ་བཅད་པ་རྣམ་པ་འདི་ལྟ་བུ་འདི་ཐོས་སོ། །ཐོས་ནས་ཀྱང་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ་རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས།
en: Monks, when King Śuddhodana heard these eloquent verses from the Śākya girl Gopā, he felt satisfied and happy, and he cheerfully rejoiced.

source: རས་བཅོས་བུ་བཟང་པོ་རིན་པོ་ཆེ་དུ་མས་སྤྲས་པ་ཟུང་གཅིག་དང་། མུ་ཏིག་གི་དོ་ཤལ་སྲང་བྱེ་བ་བརྒྱ་སྟོང་རི་བ་དང་། མུ་ཏིག་དམར་པོ་བཟང་པོས་སྤྲས་པའི་གསེར་གྱི་ཕྲེང་བས་ཤཱཀྱའི་བུ་མོ་ས་འཚོ་མ་ལ་བཀབ་ནས་ཆེད་དུ་བརྗོད་པ་འདི་ཆེད་དུ་བརྗོད་དོ།
en: He then offered her a pair of fine cotton fabrics that were set with many different types of jewels, a pearl necklace worth a hundred billion silver coins, and a garland of gold set with red pearls. The king then offered this sentiment:

source: །ཁོ་བོའི་བུ་ནི་ཡོན་ཏན་ཅི་འདྲས་བརྒྱན་པ་དང་། །མནའ་མ་རང་གི་ཡོན་ཏན་ཇི་ལྟར་རབ་སྨྲ་བ།
en: “Just as my son is adorned with good qualities, His bride too is radiant with her own good qualities.

source: །སེམས་ཅན་དག་པ་དེ་གཉིས་ཕྲད་པར་གྱུར་པ་ནི།
en: That these two pristine beings have come together

source: །མར་དང་མར་གྱི་ཉིང་ཁུ་ཇི་ལྟར་འདྲ་བ་བཞིན།
en: Is just like butter and clarified butter.”

source: །སྒྱུ་རྩལ་བསྟན་པའི་ལེའུ་སྟེ་བཅུ་གཉིས་པའོ།། །།འཕགས་པ་རྒྱ་ཆེར་རོལ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: This concludes the twelfth chapter, on demonstrating skill in the arts.

source: དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བཙུན་མོའི་འཁོར་གྱི་ནང་ན་འདུག་པ་ན། གང་དག་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་བྱེད་པ་ལ་སྤྲོ་བར་གྱུར་པ། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དུ་མ་དེ་དག་རང་རང་གི་དགའ་བའི་སྒྲ་འབྱིན་ཅིང་ལྷགས་པར་གྱུར་ཏོ།
en: Monks, while the Bodhisattva was staying in the midst of his retinue of consorts, there were numerous gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kinnaras, and mahoragas, as well as Śakra and Brahmā and the guardians of the world, who were eager to make offerings to the Bodhisattva. They arrived calling out in joyous voices.

source: །དེ་ལ་དགེ་སློང་དག་དུས་གཞན་ཞིག་ན་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་མང་པོ་དག་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ།
en: However, monks, as time went on, many of these gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kinnaras, and mahoragas, as well as Śakra, Brahmā, and the world protectors, began to think to themselves:

source: མ་ལ་སྐྱེས་བུ་དམ་པ་འདི་བཙུན་མོའི་འཁོར་གྱི་ནང་དུ་ཧ་ཅང་ཡུན་རིང་དུ་ཐོགས་པར་གྱུར་ན་སེམས་ཅན་གང་དག་འདིས་ཡུན་རིང་པོ་ནས་བསྡུ་བའི་དངོས་པོ་བཞི་པོ་སྦྱིན་པ་དང་། སྙན་པར་སྨྲ་བ་དང་། དོན་སྤྱད་པ་དང་། དོན་འཐུན་པས་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དང་།
en: “Now, isn’t this sacred being staying too long among the consorts? There are beings who have been brought to maturity over a long period of time through the four means of attracting disciples, namely generosity, kind talk, meaningful actions, and practicing what one preaches.

source: གང་དག་འདིས་བྱང་ཆུབ་ཐོབ་ནས། ཆོས་བསྟན་པ་ཤེས་པར་འགྱུར་བ་ཆོས་ཀྱི་སྣོད་དུ་གྱུར་པའི་སེམས་ཅན་དེ་དག་མེད་པར་གྱུར་ནས།
en: Once he attains awakening, those beings would be able to understand his teachings on the Dharma. But perhaps all these suitable recipients for his teaching may be gone by then.

source: ཕྱིས་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་བྱུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་འཚང་རྒྱ་བའམ་ཅིག་ཏུ་མི་འགྱུར་གྲང་སྙམ་མོ།
en: In that case, the Bodhisattva will leave his home and awaken to unexcelled, perfect, and complete buddhahood on his own.”

source: །དེ་ནས་དེ་དག་གུས་པ་དང་བཅས་ཞེ་ས་དང་བཅས་པར་ཐལ་མོ་སྦྱར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱག་འཚལ་ནས།
en: So they approached the Bodhisattva. Full of respect and devotion, they joined their palms and bowed before him. Standing expectantly in his presence, they asked with concern:

source: ནམ་ཞིག་ན་བདག་ཅག་གིས་བྱང་ཆུབ་སེམས་དཔའ་དམ་པ་མཆོག་རབ་དག་པ་འདི་མངོན་པར་བྱུང་བ་དང་། མངོན་པར་བྱུང་ནས་ཀྱང་ཤིང་གི་རྒྱལ་པོ་ཆེན་པོ་དེའི་དྲུང་དུ་འདུག་སྟེ།
en: “Will we ever witness the Bodhisattva—this sacred, supreme, and pure being—leave home as an act of renunciation?

source: བདུད་དཔུང་དང་བཅས་པ་བཏུལ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: Once he has left home, will we see him sitting under the great king of trees, taming Māra and his army, and awakening to unexcelled, perfect, and complete buddhahood?

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་ལྡན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བཞི་དང་ལྡན་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་དང་ལྡན་པ་དང་། ལན་གསུམ་དུ་བཟླས་ཏེ་རྣམ་པ་བཅུ་གཉིས་སུ་བསྐོར་བའི་ཆོས་ཀྱི་འཁོར་ལོ་བླ་ན་མེད་པ་སྐོར་ཞིང་སངས་རྒྱས་ཀྱི་རྣམ་པར་རོལ་པ་ཆེན་པོས་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ལེགས་པར་བཤད་པས་ཚིམ་པར་བྱེད་པ་མཐོང་བར་འགྱུར་སྙམ་པའི་བསམ་པ་དེ་ལྟ་བུས་སྡོད་ཅིང་འཁོད་པར་གྱུར་ཏོ།
en: “When shall we see him accessing the ten powers of the thus-gone ones, the four types of fearlessness of the thus-gone ones, and the eighteen unique qualities of a buddha? Or spinning the unexcelled wheel of Dharma in its twelve aspects? Or teaching, through a vast display of buddhahood, according to the wishes of the world, including its gods, humans, and demigods, and satisfying them?”

source: །དགེ་སློང་དག་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་གྲངས་མེད་པ་ནས་བཟུང་སྟེ། ཡུན་རིང་པོར་རྟག་པར་རྒྱུན་ཏུ་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཐམས་ཅད་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པར་གྱུར་ཅིང་།
en: Monks, for a long time—many uncountable eons—the Bodhisattva had always and continuously been without any need to rely on others.

source: དགེ་བའི་ཆོས་སྤྱོད་པ་ཐམས་ཅད་ལ་བདག་ཉིད་སློབ་དཔོན་དུ་གྱུར་པ་ཡིན་ལ།
en: He was his own master with regard to worldly concerns, as well as those that go beyond the world.

source: ཡུན་རིང་པོ་ནས་དུས་ཤེས་པ་དང་། ཚོད་ཤེས་པ་དང་། རན་པ་ཤེས་པར་གྱུར་པ་དང་། མངོན་པར་ཤེས་པ་ལས་མ་ཉམས་པ་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པས་རྣམ་པར་རྩེ་བ་དང་། སེམས་ཅན་གྱི་བསམ་པ་དང་དབང་པོ་ལ་མཁས་པ་དང་། དུས་དང་དུས་མ་ཡིན་པ་ཤེས་པ་དང་། དུས་ལ་ལྟ་ཞིང་རྒྱ་མཚོ་ཆེན་པོ་ལྟར་དུས་རན་པ་ལས་མི་ཡོལ་བར་གྱུར་པའོ།
en: For a long time he had known the right time, the occasion, and the opportunity for the practice of all aspects of the roots of virtue. His higher knowledge was flawless, and his five types of superknowledge were fully manifest. Since he had a masterly command of his sense faculties, he could manifest miraculous powers. He knew indeed what was timely as well as what was untimely. Seeking the right opportunity, he would never miss it, just like the great ocean, which is always timely.

source: །དེ་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་ལྡན་པས་འདི་ནི་རབ་ཏུ་གཟུང་བའི་དུས་སོ། །འདི་ནི་ཚར་གཅད་པའི་དུས་སོ། །འདི་ནི་བསྡུ་བའི་དུས་སོ། །འདི་ནི་ཕན་གདགས་པའི་དུས་སོ། །འདི་ནི་བཏང་སྙོམས་སུ་གཞག་པའི་དུས་སོ། །འདི་ནི་སྨྲ་བའི་དུས་སོ། །འདི་ནི་མི་སྨྲ་བར་བྱ་བའི་དུས་སོ། །འདི་ནི་ཁྱིམ་ནས་འབྱུང་བའི་དུས་སོ། །འདི་ནི་རབ་ཏུ་འབྱུང་བའི་དུས་སོ། །འདི་ནི་ཁ་ཏོན་བྱ་བའི་དུས་སོ། །འདི་ནི་ཚུལ་བཞིན་ཡིད་ལ་བྱ་བའི་དུས་སོ། །འདི་ནི་རབ་ཏུ་དབེན་པར་བྱ་བའི་དུས་སོ། །འདི་ནི་རྒྱལ་རིགས་ཀྱི་འཁོར་གྱི་ནང་དུ་འགྲོ་བའི་དུས་སོ་ཞེས་བྱ་བ་ནས། འདི་ནི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་གི་བར་གྱི་འཁོར་གྱི་ནང་དུ་འགྲོ་བའི་དུས་སོ། །འདི་ནི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མའི་འཁོར་གྱི་ནང་དུ་འགྲོ་བའི་དུས་སོ། །འདི་ནི་ཆོས་བསྟན་པའི་དུས་སོ། ། འདི་ནི་ནང་དུ་ཡང་དག་པར་གཞག་པའི་དུས་སོ་ཞེས་བྱ་བ་ཐམས་ཅད་བདག་ཉིད་ཀྱིས་ཤེས་སོ། །
en: Since he possessed the power of clairvoyant wisdom, he knew everything himself: “This is the appropriate time for reaching out, this is the time for separation, this is the time for getting together, this is the time for showing kindness, this is the time for resting in equanimity, this is the time to speak, this is the time to remain silent, this is the time to leave home, this is the time to take ordination, this is the time to recite, this is the time for deep reflection, this is the time to stay in solitude, this is the time to stay within royal circles, this is the time to be among priests and householders, and this is the time to be among gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kinnaras, mahoragas, Śakra, Brahmā, the world protectors, monks, nuns, as well as male and female novices. This is the time to teach the Dharma, and this is the time to rest inwardly.”

source: བྱང་ཆུབ་སེམས་དཔའ་དུས་ཐམས་ཅད་དུ་རྟག་པར་འདུ་ཤེས་པར་གྱུར་ཅིང་།
en: At all times the Bodhisattva knew whether the time was suitable or not, and he watched out for opportunities.

source: དུས་ལ་ལྟ་བ་ཡིན་ཡང་དགེ་སློང་དག་འདི་ནི་ཆོས་ཉིད་ཀྱིས་ཐོབ་པ་ཡིན་ཏེ། སྲིད་པ་ཐ་མ་པའི་བྱང་ཆུབ་སེམས་དཔའ་བཙུན་མོའི་འཁོར་གྱི་ནང་ན་འཁོད་པ་རྣམས་ལ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་བཞུགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་གླུ་དབྱངས་དང་སིལ་སྙན་གྱི་སྒྲ་ལས་ཆོས་ཀྱི་སྒོ་རྣམ་པ་འདི་ལྟ་བུ་འདི་དག་གིས་ཡང་དག་པར་སྐུལ་བ་མཛད་དོ།
en: Monks, for bodhisattvas who have reached their last existence, it is customary that the buddhas, the blessed ones, who dwell in the realms within the ten directions, always come while these bodhisattvas amuse themselves in the female quarters and encourage them through singing and music to enter the gate of Dharma.

source: སེམས་ཅན་མཆོག་གང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་བཞུགས།
en: Whatever perfect beings abide in the worlds of the ten directions,

source: །དེ་དག་མཐུ་ཡིས་སིལ་སྙན་སྒྲ་དག་ལས།
en: It is through their special power that, accompanied by music,

source: །ཚིགས་བཅད་སྒྲ་སྙན་འདི་དག་བྱུང་བ་ཡིས།
en: These verses and songs, so pleasant and sweet,

source: །མི་མཆོག་དམ་པ་རྣམས་ལ་ཡང་དག་སྐུལ།
en: Encourage the supreme being to renounce his home.

source: །སྡུག་བསྔལ་བརྒྱས་གང་སེམས་ཅན་མཐོང་ནས་ནི། །འགྲོ་བའི་མགོན་དང་སྐྱབས་དང་གནས་འགྱུར་ཞིང་། །ཕན་བྱེད་མཆོག་དང་དཔུང་གཉེན་གྱུར་ཅིག་ཅེས། །ཁྱོད་ཀྱིས་སྔོན་ནི་སྨོན་ལམ་དེ་སྐད་བཏབ།
en: “When witnessing others who suffer greatly, You previously made an aspiration To become their protector and refuge, As well as their supreme supporter and defender.

source: །དགེ་བ་དཔའ་བོ་སྔོན་གྱི་སྤྱོད་པ་དང་། །འགྲོ་ཕན་བྱ་ཞེས་སྨོན་བཏབ་དྲན་པར་བྱོས།
en: “Virtuous Hero! Remember your previous actions And your vow to help others.

source: །འདི་ནི་ཁྱོད་ཀྱིས་དུས་མན་ཚོད་ཡིན་གྱིས། །དྲང་སྲོང་མཆོག་རབ་མངོན་པར་འབྱུང་བར་བྱོས། །སངས་རྒྱས་ལྷ་མི་འདུལ་བྱེད་འཇིག་རྟེན་མཆོག །ཡོན་ཏན་བརྒྱས་གང་བར་ནི་གྱུར་ཅིག་ཅེས། །དེའི་ཕྱིར་ཁྱོད་སྔོན་མགོ་དང་རྐང་ལག་དང་། །ནོར་གྱི་དམ་པ་སྣ་ཚོགས་རྣམས་ཀྱང་བཏང་།
en: This is your time, your moment; So, Supreme Sage, renounce your palace! “It is for the sake of those for whom you have previously given up The best of wealth, and even your head, arms, and legs, That you will become a buddha, the supreme tamer of gods and humans, The foremost in the world, and a storehouse of hundreds of qualities.

source: །ཁྱོད་ནི་ཁྲིམས་ཀྱིས་བརྟུལ་ཞུགས་དཀའ་ཐུབ་སྤྱད།
en: “With discipline you must perform austerities and hardship;

source: །ཁྱོད་ནི་བཟོད་པས་འགྲོ་ལ་ཕན་པ་བྱེད།
en: With patience you will benefit others.

source: །ཁྱོད་ནི་བརྩོན་པས་ཡོན་ཏན་བརྒྱ་ཡིས་གང་།
en: With diligence you will unfold all good qualities;

source: །བསམ་གཏན་ཤེས་རབ་སྲིད་གསུམ་མཉམ་པ་མེད།
en: Your concentration and knowledge will have no equal in the three realms.

source: །ཁྲོ་བས་ནོན་ཅིང་ཐ་བའི་དྲི་མང་བ།
en: “The many beings afflicted by anger and blemished by hate

source: །དེ་དག་བདེ་གཤེགས་ཁྱོད་ཀྱི་བྱམས་པས་ཁྱབ།
en: Must be embraced by your love, Thus-Gone One.

source: །དགེ་བའི་ཡོན་ཏན་བྲལ་བ་ལོག་ངེས་པ།
en: Those who are lost and without any qualities of goodness

source: །མི་མཁས་རྣམ་མང་དག་ལ་ཁྱོད་སྙིང་རྗེ།
en: And the many unskillful ones must all feel your compassion.

source: །བསོད་ནམས་ཡེ་ཤེས་དགེ་བའི་ལུས་ཁྱབ་ཅིང་།
en: “With your merit and wisdom, virtue pervades your body;

source: །རྡུལ་བྲལ་བསམ་གཏན་མངོན་ཤེས་ལམ་མེར་འདུག །ཕྱོགས་བཅུ་འདི་དག་རྣམས་སུ་རབ་ཏུ་གསལ།
en: With your stainless concentration and higher knowledge, you shine brightly. You illumine the ten directions,

source: །སྤྲིན་མེད་ཟླ་བ་དྲི་མ་མེད་པ་འདྲ།
en: Like the stainless moon free from clouds.”

source: །འདི་དང་གཞན་ཡང་སྙན་པ་རྣམ་མང་གིས།
en: Many such pleasing words, accompanied by music,

source: །སིལ་སྙན་དག་ལས་རྒྱལ་བས་སྒྲ་བསྒྲགས་ཏེ། །མངོན་པར་ཁྱོད་འབྱུང་དུས་ནི་འདི་ཡིན་ཞེས། །ལྷ་མིས་མཆོད་པར་འོས་ལ་སྐུལ་མ་འདེབས།
en: Are sung by the victorious ones. They encourage the One Who Gods and Humans Venerate, saying, “This is the time for you to renounce your palace.”

source: །དགེ་སློང་དག་བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་དམ་པ་མཆོག་ཡོ་བྱད་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་དང་ལྡན་པ། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་བདེ་བར་གནས་པ་དང་འཐུན་པ།
en: Monks, the home of the Bodhisattva was indeed exquisite, complete with the most perfect belongings. It was anything a person could wish for, full of all the things necessary for comfortable living.

source: ལྷའི་ཁང་ཁྱིམ་ལྟ་བུ་སྟེགས་བུ་དང་། སྒོ་ཁང་དང་། རྟ་བབས་དང་། སྐར་ཁུང་དང་། བསིལ་ཁང་དང་། ཁང་པ་བརྩེགས་པ་དང་། ཁང་བཟངས་མཆོག་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱན་རྣམ་པ་ཐ་དད་པ་དབྱེ་བ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ།
en: Like a divine palace, it had the very best of verandas, turrets, porticoes, skylights, corridors, upper floors, and terraces. It was adorned with all sorts of jewels in many different arrangements and patterns.

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་བསྒྲེང་བ།
en: Parasols, flags, and banners were hoisted.

source: རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་དུ་མས་ལེགས་པར་བརྒྱན་པ། དར་གྱི་ལྡ་ལྡི་བརྒྱ་སྟོང་དུ་མས་མངོན་པར་སྤྱངས་པ།
en: Fine bells made of gems hung from lattices, as did hundreds of thousands of silk streamers.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པའི་མུ་ཏིག་གི་རྒྱན་ཕྲེང་རབ་ཏུ་སྤྱངས་པ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་སྤང་ལེབ་ཅན་གྱི་ཟམ་པས་མཛེས་པར་བྱས་པ།
en: There were garlands of pearls set with various precious stones, and bridges built with boards that were ornamented by all types of jewels.

source: མེ་ཏོག་གི་ཕྲེང་བ་དང་ཆུན་པོ་མང་པོ་སྤྱངས་པ།
en: Flower garlands and decorations hung everywhere.

source: པོག་སྣོད་ནས་སྤོས་ཀྱིས་བདུགས་པ། དར་ལའི་བླ་རེ་བྲེས་པ། དུས་ཐམས་ཅད་པའི་མེ་ཏོག་དྲི་མཆོག་ཏུ་ཞིམ་ཞིང་། ཤིན་ཏུ་མཛེས་པ་དག་བཀྲམ་པ།
en: Incense burners dispensed fragrant smoke, and silk canopies were spread above.

source: རྫིང་མེ་ཏོག་པད་མ་དཀར་པོ་དང་། པད་མ་དང་ལྡན་པའི་ཆུའི་གནས་ཡོངས་སུ་སྤྱད་པར་བྱ་བ་མང་བ།
en: Fragrant flowers from all seasons adorned the grounds, and the ponds were full of white lotus flowers in bloom.

source: བྱ་འདབ་སྐྱོང་དང་། ནེ་ཙོ་དང་། རི་སྐེགས་དང་། ཁུ་བྱུག་དང་། ངང་པ་དང་། རྨ་བྱ་དང་། ངུར་པ་དང་། ཀུ་ན་ལ་དང་། ཀ་ལ་པིང་ཀ་དང་། ཤང་ཤང་ཏེའུ་ལ་སོགས་པ་བྱ་རྣམ་པ་ཐ་དད་པའི་ཚོགས་སྒྲ་སྙན་པ་འབྱིན་པ།
en: In all the many lotus ponds were flocks of many types of birds, such as leafbirds, parrots, mynas, cuckoos, swans, peacocks, wild geese, kunālas, and pheasants that all called out in their beautiful voices.

source: བཻ་དཱུརྱ་སྔོན་པོའི་ས་གཞི་གནས་ཡོངས་སུ་སྤྱད་པར་བྱ་བ། གཟུགས་ཐམས་ཅད་ཀྱི་གཟུགས་བརྙན་ཀུན་ཏུ་སྟོན་པ།
en: There were grounds covered in blue beryl that reflected all the many fine features of the palace.

source: བལྟ་བས་མི་ངོམས་པར་ཉམས་དགའ་བ།
en: It was so delightful to watch, and thus one could never get enough.

source: དགའ་བ་དང་མཆོག་ཏུ་དགའ་བ་དམ་པ་སྐྱེད་པའི་ཁྱིམ་དམ་པ་མཆོག་དེ་ན་འདུག་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ཁང་པ་མཛེས་པ་ཆེན་པོ་མཆོག་ན་གནས་པ། དྲི་མ་མེད་པ། དྲི་མ་དང་བྲལ་བ།
en: The exquisite and perfect mansion where the Bodhisattva lived was a source of supreme pleasures and joy.

source: ཡན་ལག་དྲི་མ་མེད་པ། ཕྲེང་བ་དང་རྒྱན་མ་བོར་བ། དྲི་མཆོག་ཏུ་ཞིམ་པ་དམ་པའི་བྱུག་པས་ལུས་བསྐུས་པ།
en: In his palace his body was always pure and stainless, he was adorned with flower garlands and jewelry, and his limbs were scented with the finest and most sweet-smelling oils.

source: དཀར་ཞིང་བཟང་ལ་དྲི་མ་མེད་ཅིང་རྣམ་པར་དག་ལ་དྲི་མ་དང་བྲལ་བའི་གོས་གྱོན་པའི་ལུས་དང་ལྡན་པ།
en: To cover his body he wore stainless white clothes of the finest quality, without any blemishes whatsoever.

source: མལ་ཆ་ལྷའི་རས་བཅོས་བུ་བཟང་པོ་ཕྲ་བ་དུ་མ་བཏིང་བ་འཇམ་པ་ཀ་ཙ་ལིན་དའི་གོས་ལྟར་རེག་ན་བདེ་བ།
en: His bedding was made of divine fabrics of the finest thread, and as soft to the touch as the kācilindika cloth.

source: ཡན་ལག་དམ་པས་སྤྲས་པའི་མལ་བཟང་པོའི་སྟེང་ན་འདུག་པ་བཙུན་མོའི་འཁོར་དམ་པ་ལྷའི་བུ་མོ་དང་འདྲ་བ། ཐམས་ཅད་དུ་ཁ་ན་མ་ཐོ་བ་མེད་པ། ལྟ་བ་དང་འཐུན་པ།
en: There on his perfect couch, he lay surrounded by his wonderful retinue of consorts, who all resembled goddesses.

source: སྤྱོད་པ་བཟང་པོས་མཛེས་པར་བྱས་པ།
en: All the girls were virtuous, agreeable, and wholesome in conduct.

source: གཟུགས་བཟང་བའི་ནང་ན་འདུག་པ། དུང་དང་། རྔ་དང་། རྫ་རྔ་དང་། ཁར་རྔ་དང་། པི་བང་དང་། རྒྱུད་གསུམ་པ་དང་། ཁར་བའི་སིལ་ཁྲོལ་དང་། ཕེག་དང་། ཀིམ་པ་ལ་དང་། ན་ཀུ་ལ་དང་། སྒྲ་སྙན་དང་། གླིང་བུ་སྙན་པའི་སྒྲ་འབྱུང་བའི་སྒྲ་དབྱངས་དང་། སིལ་སྙན་དང་། གླུ་དབྱངས་སྣ་ཚོགས་དང་ལྡན་པས་བསླང་བ་ལ།
en: Inside this beautiful palace, the Bodhisattva woke up to the sound of conches, kettledrums, clay drums, wood drums, lutes, harps, tambourines, cymbals, and flutes that produced the most sweet-sounding and melodious tunes to accompany their many sweet songs.

source: བུད་མེད་ཀྱི་ཚོགས་ཀྱིས་ཀྱང་། སྒྲ་མཉེན་ཞིང་འཇམ་པ་སྙན་ལ་ཡིད་དུ་འོང་བ་དང་། གླིང་བུ་འབུད་པའི་སྒྲ་དབྱངས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སློང་ངོ་།
en: The girls woke up the Bodhisattva with beautiful and soft songs accompanied by the melodious tones of flutes.

source: །ཕྱོགས་བཅུ་ན་བཞུགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་བྱིན་གྱི་རླབས་ཀྱིས་སིལ་སྙན་གྱི་སྒྲ་བྱུང་བའི་སྒྲ་སྐད་དེ་དག་ལས་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྐུལ་བའི་ཚིགས་སུ་བཅད་པ་འདི་དག་བྱུང་ངོ་།
en: However, due to the grace of the blessed ones, the buddhas in the ten directions, the instruments suddenly began to encourage the Bodhisattva by resounding with these verses:

source: །བུད་མེད་གང་དག་རབ་ཏུ་ཡིད་དགའ་སེམས་དང་བས།
en: The girls are delighted and joyful;

source: །སིལ་སྙན་ཡིད་དུ་འོང་ཞིང་སྙན་པའི་སྒྲ་འབྱིན་ཚེ།
en: They play fine melodies on beautiful instruments.

source: །ཕྱོགས་བཅུའི་རྒྱལ་བ་དམ་པ་དག་གི་མཐུ་ཡིས་ནི།
en: At that moment, by the power of the victorious ones in the ten directions,

source: །ཚིགས་བཅད་རྣམ་པ་སྣ་ཚོགས་རྣམ་མང་འདི་དག་བྱུང་།
en: These many verses can be heard, in all their diversity:

source: །རྟག་ཏུ་མགོན་མེད་གྱུར་པའི་འགྲོ་བ་འདི་མཐོང་ནས། །གོ་འཕང་མྱ་ངན་མེད་མཆོག་རྡུལ་མེད་སངས་རྒྱས་ཏེ། །སྐྱེ་དང་རྒ་དང་སྡུག་བསྔལ་དག་ལས་དགྲོལ་ལོ་ཞེས། །དཔའ་བོ་ཁྱོད་སྔོན་སྨོན་ལམ་དེ་སྐད་བཏབ་པར་གྱུར།
en: “Seeing the beings who are forever without protector, Hero, you made the following promise: ‘I will awaken to the supreme state without old age or grief So that I can deliver all beings from death, old age, and other sufferings.’

source: །དེ་ཕྱིར་དགེ་མྱུར་གྲོང་ཁྱེར་མཆོག་འདི་ནས།
en: “Therefore, Virtuous One, quickly leave this fine city

source: །བྱུང་ལ་སྔོན་གྱི་དྲང་སྲོང་ཞབས་བཅགས་པ།
en: And practice the conduct of previous sages.

source: །ས་ཕྱོགས་དེ་ནི་རབ་ཏུ་མནན་ནས་སུ།
en: When you reach the right place on the earth,

source: །རྒྱལ་བའི་ཡེ་ཤེས་མཚུངས་མེད་འཚང་རྒྱར་གྱིས།
en: You shall awaken to the incomparable wisdom of the victorious ones.

source: །ཁྱོད་ཀྱིས་སྔོན་ཆད་སྣ་ཚོགས་རིན་ཆེན་ནོར།
en: “In the past you gave away your exquisite wealth and riches,

source: །རྐང་ལག་ཕངས་པའི་ལུས་ཀྱང་བཏང་བར་གྱུར།
en: And even your hands, feet, and dear body.

source: །དྲང་སྲོང་ཆེན་པོ་དི་རིང་ཁྱོད་དུས་འདི།
en: Great Sage, now is your time;

source: །ཆོས་ཀྱི་ཆུ་བོ་མཐའ་ཡས་འགྲོ་ལ་ཕྱེ།
en: Open up the limitless river of Dharma for sentient beings.

source: །ཁྱོད་ཀྱི་ཚུལ་ཁྲིམས་མ་ཉམས་དྲི་མེད་དགེ།
en: “Your stainless and virtuous discipline has never been broken;

source: །སྔོན་ཆད་ཁྱོད་ནི་རྟག་ཏུ་མཆོག་གིས་བརྒྱན།
en: Until now you have always been adorned by the best qualities.
